### Importing important packages

In [1]:
import pandas as pd
import matplotlib as plt
import seaborn as sns
import numpy as np
%matplotlib inline

In [2]:
df=pd.read_csv('Banking.csv')

In [3]:
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [4]:
X=df[['Age','Tenure','Balance','EstimatedSalary']]
y=df['Exited']

In [5]:
X

      Age  Tenure    Balance  EstimatedSalary
0      42       2       0.00        101348.88
1      41       1   83807.86        112542.58
2      42       8  159660.80        113931.57
3      39       1       0.00         93826.63
4      43       2  125510.82         79084.10
...   ...     ...        ...              ...
9995   39       5       0.00         96270.64
9996   35      10   57369.61        101699.77
9997   36       7       0.00         42085.58
9998   42       3   75075.31         92888.52
9999   28       4  130142.79         38190.78

[10000 rows x 4 columns]

In [6]:
# y determines whether acc. holder leave the acc. or not
y

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

### Splitting of dataset

In [7]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=2,test_size=0.15)

In [8]:
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(8500, 4)
(1500, 4)
(8500,)
(1500,)

### Importing Logistic Regression

In [9]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()

### fit the model to the training data

In [10]:
model.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [11]:
pred = model.predict(X_test)

In [12]:
pred

array([0, 0, 0, ..., 0, 0, 0], dtype=int64)

In [13]:
from sklearn.metrics import confusion_matrix,accuracy_score

### Confusion Matrix

In [14]:
confusion_matrix(y_test,pred)

array([[1230,    0],
       [ 270,    0]], dtype=int64)

### Accuracy score

In [15]:
accuracy_score(y_test,pred)

0.82